app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE (actual_departure >= '2011-10-27 20:50:53.889818') ORDER BY updated_at ASC LIMIT 1
---
  def index
    @flights = Flight.all

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", "29"]]
---
  def show
    @flight = Flight.find(params[:id])

INSERT INTO "flights" ("actual_arrival", "actual_departure", "arrival_location", "arrival_terminal", "created_at", "departure_location", "departure_terminal", "flight_number", "name", "planned_arrival", "planned_departure", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(params[:flight])
    #logger.info @flight.inspect

    @flight=Flight.get_details(@flight.flight_number)

    respond_to do |format|
      if @flight.save

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", "23"]]
DELETE FROM "flights" WHERE "flights"."id" = ?  [["id", 23]]
---
  def destroy
    @flight = Flight.find(params[:id])
    @flight.destroy